#!/usr/bin/perl

use strict;
use POSIX;
use Fcntl ':flock';
use Encode;

my $date;
my %kv;
my %u;
my %p;

my %timesarry =("p1"=>1,"p2"=>2,"p3"=>3,"p4"=>4,"p5"=>5,"p6"=>6,"p7"=>7,"p8"=>8,"p9"=>9,"p10"=>10,"p11"=>11,"p12"=>12,"p13"=>13,"p14"=>14,"p15"=>15,"p16"=>16,"p17"=>17,"p18"=>18,"p19"=>19,"p20"=>20,"p21"=>21,"p22"=>22,"p23"=>23,"p24"=>24,"p25"=>25,"p26"=>26,"p27"=>27,"p28"=>28,"p29"=>29,"p30"=>30);

while(<STDIN>)
{
    my $row = $_;
    chomp($row);
    my @r = split(/\s/, $row);
	
    $r[0] =~ s/-//g;
    $date = $r[0];
    #  0                         1                                         2   3            
    # 8位随机数+LDST+2000(平台)|客户端版本号 客户端build号 打点数据版本号|jid|android
    #        4                  5                  6                7          8
    # mode|android版本|用户每天平均使用次数|用户每天平均弹窗次数|使用时间|会话停留时间|
    #        9                10                 11                 12                       13             14                 15
    # 用户发送消息条数|发送收费信息的条数|发送免费消息的条数|发送阅后即焚消息的总条数|发送图片的张数|发送语音消息的条数|平均语音时长|
    #       16                     17                 18                       19                 20               21                 22
    # 用户加入群聊的平均个数|用户当日群发总次数|通过拨号盘拨打电话总次数|接管系统通讯录统计|设置群内昵称人数|群消息通知状态人数|将群保存到通讯录人数|
    #       23               24               25                   26               27               28
    # 界面绘制最大时间|程序进入最大时间|单聊会话进入最大时间|群发语音消息时长|程序启动平均时间|聊天会话进入平均时间
	
    #2013-11-05 01:21:53     2000|0.9.5|1000399|Sensation|16|1|0|2147483647|2147483647|0|0|0|0|0|0|0
    #2013-11-05 10:01:21     2000|0.9.5 b1165 5|1000019|M040|16|31|0|19|4|0|0|0|0|0|0|0|7|0|0|0|0|7|0|0|0|0|0|0|0|0|0|0|0
	
    my @l = split(/\|/, $row);
	
    if(!($l[1] =~ /^.+\sb.+$/))
    {
        next;
    }
	
    if(@l > 30)
    {
        next;
    }
	
    if(@l < 20)
    {
        $l[23] = $l[16];
        $l[24] = $l[17];
        $l[25] = $l[18];
		
        $l[16] = 0;
        $l[17] = 0;
        $l[18] = 0;
        $l[19] = 0;
        $l[20] = 0;
        $l[21] = 0;
        $l[22] = 0;
    }
	
    my @l1 = split(/\s+/, $l[1]);
    my $client_v = $l1[0]."_".$l1[1];
	
    $kv{"STAT"."|"."USED"} += $l[5];#使用次数
    $kv{"STAT"."|"."POP"} += $l[6];#弹窗次数
    if( $l[7]> 0 && $l[7]<86400 )
    {
        $kv{"STAT"."|"."SERVICE"} += $l[7];#使用时间
    }
    if( $l[8]> 0 && $l[8]<86400 )
    {
        $kv{"STAT"."|"."STAYED"} += $l[8];#会话停留时间
    }
    $kv{"STAT"."|"."TOTALMSG"} += $l[9];#发送消息总条数
    $kv{"STAT"."|"."FEE"} += $l[10];#发送收费消息条数
    $kv{"STAT"."|"."FREE"} += $l[11];#发送免费消息条数
    $kv{"STAT"."|"."VLENGTH"} += $l[15];#语音时长
    $kv{"STAT"."|"."GNUM"} += $l[16];#当日累积群数
    $kv{"STAT"."|"."GSMS"} += $l[17];#用户当日群发总次数
    $kv{"STAT"."|"."DAIL"} += $l[18];#通过拨号盘拨号总次数
    
    if($l[19] eq "1")
    {
        $kv{"STAT"."|"."DEFEE"} += $l[10];#设为默认程序的用户当日发送收费消息条数
        $kv{"STAT"."|"."DEFREE"} += $l[11];#设为默认程序的用户当日发送免费消息条数
    }

    if($l[27]>0)
    {
        $kv{"STAT"."|"."AVE_STAR"} += $l[27];#程序启动平均时间
    }
	
    if($l[28]>0)
    {
        $kv{"STAT"."|"."AVE_TALK"} += $l[28];#载入聊天会话进入平均时间
    }
	
    #过滤过大的干扰数据
    if($l[23] > 10000)
    {
        $l[23] = 0;
    }
	
    if($l[24] > 10000)
    {
        $l[24] = 0;
    }
	
    if($l[25] > 10000)
    {
        $l[25] = 0;
    }
	 
    if($l[23] > $kv{"STAT"."|"."MAX_LOAD"})
    {
        $kv{"STAT"."|"."MAX_LOAD"} = $l[23];#界面绘制最大时间
    }
	
    if($l[24] > $kv{"STAT"."|"."MAX_STAR"})
    {
        $kv{"STAT"."|"."MAX_STAR"} = $l[24];#程序进入最大时间
    }
	
    if($l[25] > $kv{"STAT"."|"."MAX_TALK"})
    {
        $kv{"STAT"."|"."MAX_TALK"} = $l[25];#单聊会话进入最大时间
    }
	
    # 使用用户
    if($l[5] > 0)
    {
        $u{"UID"."|".$l[2]} = 0;
    }

    # 弹窗用户
    if($l[6] > 0)
    {
        $u{"PID"."|".$l[2]} = 0;
    }
	
    # 会话用户
    if($l[8] > 0)
    {
        $u{"MID"."|".$l[2]} = 0;
    }
	
    # 群用户JID
    if($l[16] > 0)
    {
        $u{"GID"."|".$l[2]} = 0;
    }
	
    # 发送消息用户
    if($l[9] > 0)
    {
        $u{"SID"."|".$l[2]} = 0;
    }
	
    # 发送收费消息（短信）用户
    if($l[10] > 0)
    {
        $u{"FID"."|".$l[2]} = 0;
    }
    
    # 发送语音用户
    if($l[14] > 0)
    {
        $u{"VID"."|".$l[2]} = 0;
    }
	
    foreach my $key (keys %timesarry)
    {	
        if($l[5] == $timesarry{$key})
        {
            print("PERUSETIME"."|".$l[2]."\t".$l[5]."\t".$date."\n");
        }
    }
		
    if($l[5] >= 31)
    {
        print("PERUSETIME"."|".$l[2]."\t".$l[5]."\t".$date."\n");
    }
	
    foreach my $key (keys %timesarry)
    {	
        if($l[6] == $timesarry{$key})
        {  
            print("PERPOPTIME"."|".$l[2]."\t".$l[6]."\t".$date."\n");
        }	
    }
	
    if($l[6] >= 31)
    {
        print("PERPOPTIME"."|".$l[2]."\t".$l[6]."\t".$date."\n");
    }

    #分版本用户
    #$u{"$client_v"."\t"."CID"."\t".$l[2]} = 0;献鹏
	
    #分版本用户
    $u{"CID|".$l[2]."|".$client_v} = 0;
	
    # 设置/取消设置通讯录用户
    if($l[19] eq "1")
    {
        $u{"DEF"."|".$l[2]} = 0;
    }
    else
    {
        $u{"UNDEF"."|".$l[2]} = 0;
    }
	
    # 修改昵称用户
    if($l[20] > 0)
    {
        $u{"GNICK"."|".$l[2]} = 0;
    }
	
    #设置群消息通知用户
    if(($l[16] - $l[21]) > 0)
    {
        $u{"GNOT"."|".$l[2]} = 0;
    }
	
    # 保存群到通讯录用户
    if($l[22] > 0)
    {
        $u{"GSAVE"."|".$l[2]} = 0;
    }
}

#kv ->STAT
for my $k (keys %kv)
{
    print($k."\t".$kv{$k}."\t".$date."\n");
}

#u ->PID ……
for my $k (keys %u)
{
    print($k."\t".$date."\n");
}

# Last Version 
